Repository: Gaudiot/ctcl_manager
Catalog: lib/l10n/app_*.arb
Languages: pt

# class_title
source: Class
pt: Turma

source: Classes
pt: Turmas

# new_class
source: + Class
pt: + Turma

# classes_loading_error
source: Error loading classes
pt: Erro ao carregar turmas

source: Class name
pt: Nome da turma

source: Class description
pt: Descrição da turma

source: Create Class
pt: Criar Turma

source: Delete Class
pt: Apagar Turma

# invalid_class_name_empty
source: Class name cannot be empty
pt: Nome não pode ser vazio

# invalid_class_value_empty
source: Class value cannot be empty
pt: Valor não pode ser vazio

# invalid_class_local_empty
source: Class local cannot be empty
pt: Local não pode ser vazio

source: Confirm Edit
pt: Confirmar Edição

source: Create Local
pt: Criar Local

# local_field_title
source: Local name (*)
pt: Nome do local (*)

# value_field_title
source: Value
pt: Valor

# search_field_placeholder
source: Search
pt: Pesquisar

# select_local
source: Select a local
pt: Selecione um local

# delete_class_error
source: Error deleting class
pt: Erro ao deletar classe

# delete_class_error_description
source: There was an error deleting the class. Please try again later.
pt: Houve um erro ao deletar a classe. Tente novamente mais tarde.

# update_class_error
source: Error updating class
pt: Erro ao atualizar classe

# update_class_error_description
source: There was an error updating the class. Please try again later.
pt: Houve um erro ao atualizar a classe. Tente novamente mais tarde.

# error_fetch_class_title
source: Error fetching class
pt: Erro ao buscar classe

# error_fetch_class_description
source: There was an error fetching the class. Please try again later.
pt: Houve um erro ao buscar a classe. Tente novamente mais tarde.

# error_fetch_classes_title
source: Error fetching classes
pt: Erro ao buscar classes

# error_fetch_classes_description
source: There was an error fetching the classes. Please try again later.
pt: Houve um erro ao buscar as classes. Tente novamente mais tarde.

# error_fetch_locals_title
source: Error fetching locals
pt: Erro ao buscar locais

# error_fetch_locals_description
source: There was an error fetching the locals. Please try again later.
pt: Houve um erro ao buscar os locais. Tente novamente mais tarde.

# error_create_class_title
source: Error creating class
pt: Erro ao criar classe

# error_create_class_description
source: There was an error creating the class. Please try again later.
pt: Houve um erro ao criar a classe. Tente novamente mais tarde.
